virtualabs/cutcutgo/src/packs/ATSAMA5D27CD1G_DFP/component/sdmmc.h
/* E_MMC mode */
#define SDMMC_HC1R_E_MMC_DW_Pos               _U_(1)                                               /**< (SDMMC_HC1R) Data Width Position */
#define SDMMC_HC1R_E_MMC_DW_Msk               (_U_(0x1) << SDMMC_HC1R_E_MMC_DW_Pos)                /**< (SDMMC_HC1R) Data Width Mask */
#define SDMMC_HC1R_E_MMC_DW(value)            (SDMMC_HC1R_E_MMC_DW_Msk & ((value) << SDMMC_HC1R_E_MMC_DW_Pos))
#define   SDMMC_HC1R_E_MMC_DW_1_BIT_Val       _U_(0x0)                                             /**< (SDMMC_HC1R) 1-bit mode.  */
#define   SDMMC_HC1R_E_MMC_DW_4_BIT_Val       _U_(0x1)                                             /**< (SDMMC_HC1R) 4-bit mode.  */
#define SDMMC_HC1R_E_MMC_DW_1_BIT             (SDMMC_HC1R_E_MMC_DW_1_BIT_Val << SDMMC_HC1R_E_MMC_DW_Pos) /**< (SDMMC_HC1R) 1-bit mode. Position  */
#define SDMMC_HC1R_E_MMC_DW_4_BIT             (SDMMC_HC1R_E_MMC_DW_4_BIT_Val << SDMMC_HC1R_E_MMC_DW_Pos) /**< (SDMMC_HC1R) 4-bit mode. Position  */
#define SDMMC_HC1R_E_MMC_HSEN_Pos             _U_(2)                                               /**< (SDMMC_HC1R) High Speed Enable Position */
#define SDMMC_HC1R_E_MMC_HSEN_Msk             (_U_(0x1) << SDMMC_HC1R_E_MMC_HSEN_Pos)              /**< (SDMMC_HC1R) High Speed Enable Mask */
#define SDMMC_HC1R_E_MMC_HSEN(value)          (SDMMC_HC1R_E_MMC_HSEN_Msk & ((value) << SDMMC_HC1R_E_MMC_HSEN_Pos))
#define SDMMC_HC1R_E_MMC_DMASEL_Pos           _U_(3)                                               /**< (SDMMC_HC1R) DMA Select Position */
#define SDMMC_HC1R_E_MMC_DMASEL_Msk           (_U_(0x3) << SDMMC_HC1R_E_MMC_DMASEL_Pos)            /**< (SDMMC_HC1R) DMA Select Mask */
#define SDMMC_HC1R_E_MMC_DMASEL(value)        (SDMMC_HC1R_E_MMC_DMASEL_Msk & ((value) << SDMMC_HC1R_E_MMC_DMASEL_Pos))
#define   SDMMC_HC1R_E_MMC_DMASEL_SDMA_Val    _U_(0x0)                                             /**< (SDMMC_HC1R) SDMA is selected  */
#define   SDMMC_HC1R_E_MMC_DMASEL_ADMA32_Val  _U_(0x2)                                             /**< (SDMMC_HC1R) 32-bit Address ADMA2 is selected  */
#define SDMMC_HC1R_E_MMC_DMASEL_SDMA          (SDMMC_HC1R_E_MMC_DMASEL_SDMA_Val << SDMMC_HC1R_E_MMC_DMASEL_Pos) /**< (SDMMC_HC1R) SDMA is selected Position  */
#define SDMMC_HC1R_E_MMC_DMASEL_ADMA32        (SDMMC_HC1R_E_MMC_DMASEL_ADMA32_Val << SDMMC_HC1R_E_MMC_DMASEL_Pos) /**< (SDMMC_HC1R) 32-bit Address ADMA2 is selected Position  */
#define SDMMC_HC1R_E_MMC_EXTDW_Pos            _U_(5)                                               /**< (SDMMC_HC1R) Extended Data Width Position */
#define SDMMC_HC1R_E_MMC_EXTDW_Msk            (_U_(0x1) << SDMMC_HC1R_E_MMC_EXTDW_Pos)             /**< (SDMMC_HC1R) Extended Data Width Mask */
#define SDMMC_HC1R_E_MMC_EXTDW(value)         (SDMMC_HC1R_E_MMC_EXTDW_Msk & ((value) << SDMMC_HC1R_E_MMC_EXTDW_Pos))
#define SDMMC_HC1R_E_MMC_Msk                  _U_(0x3E)                                             /**< (SDMMC_HC1R_E_MMC) Register Mask  */


/* -------- SDMMC_PCR : (SDMMC Offset: 0x29) (R/W 8) Power Control Register -------- */
#define SDMMC_PCR_SDBPWR_Pos                  _U_(0)                                               /**< (SDMMC_PCR) SD Bus Power Position */
#define SDMMC_PCR_SDBPWR_Msk                  (_U_(0x1) << SDMMC_PCR_SDBPWR_Pos)                   /**< (SDMMC_PCR) SD Bus Power Mask */
#define SDMMC_PCR_SDBPWR(value)               (SDMMC_PCR_SDBPWR_Msk & ((value) << SDMMC_PCR_SDBPWR_Pos))
#define SDMMC_PCR_Msk                         _U_(0x01)                                            /**< (SDMMC_PCR) Register Mask  */


/* -------- SDMMC_BGCR : (SDMMC Offset: 0x2A) (R/W 8) Block Gap Control Register -------- */
#define SDMMC_BGCR_Msk                        _U_(0x00)                                            /**< (SDMMC_BGCR) Register Mask  */

/* SD_SDIO mode */
#define SDMMC_BGCR_SD_SDIO_STPBGR_Pos         _U_(0)                                               /**< (SDMMC_BGCR) Stop At Block Gap Request Position */
#define SDMMC_BGCR_SD_SDIO_STPBGR_Msk         (_U_(0x1) << SDMMC_BGCR_SD_SDIO_STPBGR_Pos)          /**< (SDMMC_BGCR) Stop At Block Gap Request Mask */
#define SDMMC_BGCR_SD_SDIO_STPBGR(value)      (SDMMC_BGCR_SD_SDIO_STPBGR_Msk & ((value) << SDMMC_BGCR_SD_SDIO_STPBGR_Pos))
#define SDMMC_BGCR_SD_SDIO_CONTR_Pos          _U_(1)                                               /**< (SDMMC_BGCR) Continue Request Position */
#define SDMMC_BGCR_SD_SDIO_CONTR_Msk          (_U_(0x1) << SDMMC_BGCR_SD_SDIO_CONTR_Pos)           /**< (SDMMC_BGCR) Continue Request Mask */
#define SDMMC_BGCR_SD_SDIO_CONTR(value)       (SDMMC_BGCR_SD_SDIO_CONTR_Msk & ((value) << SDMMC_BGCR_SD_SDIO_CONTR_Pos))
#define SDMMC_BGCR_SD_SDIO_RWCTRL_Pos         _U_(2)                                               /**< (SDMMC_BGCR) Read Wait Control Position */
#define SDMMC_BGCR_SD_SDIO_RWCTRL_Msk         (_U_(0x1) << SDMMC_BGCR_SD_SDIO_RWCTRL_Pos)          /**< (SDMMC_BGCR) Read Wait Control Mask */
#define SDMMC_BGCR_SD_SDIO_RWCTRL(value)      (SDMMC_BGCR_SD_SDIO_RWCTRL_Msk & ((value) << SDMMC_BGCR_SD_SDIO_RWCTRL_Pos))
#define SDMMC_BGCR_SD_SDIO_INTBG_Pos          _U_(3)                                               /**< (SDMMC_BGCR) Interrupt at Block Gap Position */
#define SDMMC_BGCR_SD_SDIO_INTBG_Msk          (_U_(0x1) << SDMMC_BGCR_SD_SDIO_INTBG_Pos)           /**< (SDMMC_BGCR) Interrupt at Block Gap Mask */
#define SDMMC_BGCR_SD_SDIO_INTBG(value)       (SDMMC_BGCR_SD_SDIO_INTBG_Msk & ((value) << SDMMC_BGCR_SD_SDIO_INTBG_Pos))
#define   SDMMC_BGCR_SD_SDIO_INTBG_DISABLED_Val _U_(0x0)                                             /**< (SDMMC_BGCR) Interrupt detection disabled.  */
#define   SDMMC_BGCR_SD_SDIO_INTBG_ENABLED_Val _U_(0x1)                                             /**< (SDMMC_BGCR) Interrupt detection enabled.  */
#define SDMMC_BGCR_SD_SDIO_INTBG_DISABLED     (SDMMC_BGCR_SD_SDIO_INTBG_DISABLED_Val << SDMMC_BGCR_SD_SDIO_INTBG_Pos) /**< (SDMMC_BGCR) Interrupt detection disabled. Position  */
#define SDMMC_BGCR_SD_SDIO_INTBG_ENABLED      (SDMMC_BGCR_SD_SDIO_INTBG_ENABLED_Val << SDMMC_BGCR_SD_SDIO_INTBG_Pos) /**< (SDMMC_BGCR) Interrupt detection enabled. Position  */
#define SDMMC_BGCR_SD_SDIO_Msk                _U_(0x0F)                                             /**< (SDMMC_BGCR_SD_SDIO) Register Mask  */

