virtualabs/cutcutgo/src/packs/ATSAMA5D27CD1G_DFP/component/sdmmc.h
/* E_MMC mode */
#define SDMMC_NISTR_E_MMC_CMDC_Pos            _U_(0)                                               /**< (SDMMC_NISTR) Command Complete Position */
#define SDMMC_NISTR_E_MMC_CMDC_Msk            (_U_(0x1) << SDMMC_NISTR_E_MMC_CMDC_Pos)             /**< (SDMMC_NISTR) Command Complete Mask */
#define SDMMC_NISTR_E_MMC_CMDC(value)         (SDMMC_NISTR_E_MMC_CMDC_Msk & ((value) << SDMMC_NISTR_E_MMC_CMDC_Pos))
#define SDMMC_NISTR_E_MMC_TRFC_Pos            _U_(1)                                               /**< (SDMMC_NISTR) Transfer Complete Position */
#define SDMMC_NISTR_E_MMC_TRFC_Msk            (_U_(0x1) << SDMMC_NISTR_E_MMC_TRFC_Pos)             /**< (SDMMC_NISTR) Transfer Complete Mask */
#define SDMMC_NISTR_E_MMC_TRFC(value)         (SDMMC_NISTR_E_MMC_TRFC_Msk & ((value) << SDMMC_NISTR_E_MMC_TRFC_Pos))
#define SDMMC_NISTR_E_MMC_BLKGE_Pos           _U_(2)                                               /**< (SDMMC_NISTR) Block Gap Event Position */
#define SDMMC_NISTR_E_MMC_BLKGE_Msk           (_U_(0x1) << SDMMC_NISTR_E_MMC_BLKGE_Pos)            /**< (SDMMC_NISTR) Block Gap Event Mask */
#define SDMMC_NISTR_E_MMC_BLKGE(value)        (SDMMC_NISTR_E_MMC_BLKGE_Msk & ((value) << SDMMC_NISTR_E_MMC_BLKGE_Pos))
#define SDMMC_NISTR_E_MMC_DMAINT_Pos          _U_(3)                                               /**< (SDMMC_NISTR) DMA Interrupt Position */
#define SDMMC_NISTR_E_MMC_DMAINT_Msk          (_U_(0x1) << SDMMC_NISTR_E_MMC_DMAINT_Pos)           /**< (SDMMC_NISTR) DMA Interrupt Mask */
#define SDMMC_NISTR_E_MMC_DMAINT(value)       (SDMMC_NISTR_E_MMC_DMAINT_Msk & ((value) << SDMMC_NISTR_E_MMC_DMAINT_Pos))
#define SDMMC_NISTR_E_MMC_BWRRDY_Pos          _U_(4)                                               /**< (SDMMC_NISTR) Buffer Write Ready Position */
#define SDMMC_NISTR_E_MMC_BWRRDY_Msk          (_U_(0x1) << SDMMC_NISTR_E_MMC_BWRRDY_Pos)           /**< (SDMMC_NISTR) Buffer Write Ready Mask */
#define SDMMC_NISTR_E_MMC_BWRRDY(value)       (SDMMC_NISTR_E_MMC_BWRRDY_Msk & ((value) << SDMMC_NISTR_E_MMC_BWRRDY_Pos))
#define SDMMC_NISTR_E_MMC_BRDRDY_Pos          _U_(5)                                               /**< (SDMMC_NISTR) Buffer Read Ready Position */
#define SDMMC_NISTR_E_MMC_BRDRDY_Msk          (_U_(0x1) << SDMMC_NISTR_E_MMC_BRDRDY_Pos)           /**< (SDMMC_NISTR) Buffer Read Ready Mask */
#define SDMMC_NISTR_E_MMC_BRDRDY(value)       (SDMMC_NISTR_E_MMC_BRDRDY_Msk & ((value) << SDMMC_NISTR_E_MMC_BRDRDY_Pos))
#define SDMMC_NISTR_E_MMC_BOOTAR_Pos          _U_(14)                                              /**< (SDMMC_NISTR) Boot Acknowledge Received Position */
#define SDMMC_NISTR_E_MMC_BOOTAR_Msk          (_U_(0x1) << SDMMC_NISTR_E_MMC_BOOTAR_Pos)           /**< (SDMMC_NISTR) Boot Acknowledge Received Mask */
#define SDMMC_NISTR_E_MMC_BOOTAR(value)       (SDMMC_NISTR_E_MMC_BOOTAR_Msk & ((value) << SDMMC_NISTR_E_MMC_BOOTAR_Pos))
#define SDMMC_NISTR_E_MMC_ERRINT_Pos          _U_(15)                                              /**< (SDMMC_NISTR) Error Interrupt Position */
#define SDMMC_NISTR_E_MMC_ERRINT_Msk          (_U_(0x1) << SDMMC_NISTR_E_MMC_ERRINT_Pos)           /**< (SDMMC_NISTR) Error Interrupt Mask */
#define SDMMC_NISTR_E_MMC_ERRINT(value)       (SDMMC_NISTR_E_MMC_ERRINT_Msk & ((value) << SDMMC_NISTR_E_MMC_ERRINT_Pos))
#define SDMMC_NISTR_E_MMC_Msk                 _U_(0xC03F)                                           /**< (SDMMC_NISTR_E_MMC) Register Mask  */


/* -------- SDMMC_EISTR : (SDMMC Offset: 0x32) (R/W 16) Error Interrupt Status Register -------- */
#define SDMMC_EISTR_Msk                       _U_(0x0000)                                          /**< (SDMMC_EISTR) Register Mask  */

/* SD_SDIO mode */
#define SDMMC_EISTR_SD_SDIO_CMDTEO_Pos        _U_(0)                                               /**< (SDMMC_EISTR) Command Timeout Error Position */
#define SDMMC_EISTR_SD_SDIO_CMDTEO_Msk        (_U_(0x1) << SDMMC_EISTR_SD_SDIO_CMDTEO_Pos)         /**< (SDMMC_EISTR) Command Timeout Error Mask */
#define SDMMC_EISTR_SD_SDIO_CMDTEO(value)     (SDMMC_EISTR_SD_SDIO_CMDTEO_Msk & ((value) << SDMMC_EISTR_SD_SDIO_CMDTEO_Pos))
#define SDMMC_EISTR_SD_SDIO_CMDCRC_Pos        _U_(1)                                               /**< (SDMMC_EISTR) Command CRC Error Position */
#define SDMMC_EISTR_SD_SDIO_CMDCRC_Msk        (_U_(0x1) << SDMMC_EISTR_SD_SDIO_CMDCRC_Pos)         /**< (SDMMC_EISTR) Command CRC Error Mask */
#define SDMMC_EISTR_SD_SDIO_CMDCRC(value)     (SDMMC_EISTR_SD_SDIO_CMDCRC_Msk & ((value) << SDMMC_EISTR_SD_SDIO_CMDCRC_Pos))
#define SDMMC_EISTR_SD_SDIO_CMDEND_Pos        _U_(2)                                               /**< (SDMMC_EISTR) Command End Bit Error Position */
#define SDMMC_EISTR_SD_SDIO_CMDEND_Msk        (_U_(0x1) << SDMMC_EISTR_SD_SDIO_CMDEND_Pos)         /**< (SDMMC_EISTR) Command End Bit Error Mask */
#define SDMMC_EISTR_SD_SDIO_CMDEND(value)     (SDMMC_EISTR_SD_SDIO_CMDEND_Msk & ((value) << SDMMC_EISTR_SD_SDIO_CMDEND_Pos))
#define SDMMC_EISTR_SD_SDIO_CMDIDX_Pos        _U_(3)                                               /**< (SDMMC_EISTR) Command Index Error Position */
#define SDMMC_EISTR_SD_SDIO_CMDIDX_Msk        (_U_(0x1) << SDMMC_EISTR_SD_SDIO_CMDIDX_Pos)         /**< (SDMMC_EISTR) Command Index Error Mask */
#define SDMMC_EISTR_SD_SDIO_CMDIDX(value)     (SDMMC_EISTR_SD_SDIO_CMDIDX_Msk & ((value) << SDMMC_EISTR_SD_SDIO_CMDIDX_Pos))
#define SDMMC_EISTR_SD_SDIO_DATTEO_Pos        _U_(4)                                               /**< (SDMMC_EISTR) Data Timeout Error Position */
#define SDMMC_EISTR_SD_SDIO_DATTEO_Msk        (_U_(0x1) << SDMMC_EISTR_SD_SDIO_DATTEO_Pos)         /**< (SDMMC_EISTR) Data Timeout Error Mask */
#define SDMMC_EISTR_SD_SDIO_DATTEO(value)     (SDMMC_EISTR_SD_SDIO_DATTEO_Msk & ((value) << SDMMC_EISTR_SD_SDIO_DATTEO_Pos))
#define SDMMC_EISTR_SD_SDIO_DATCRC_Pos        _U_(5)                                               /**< (SDMMC_EISTR) Data CRC error Position */
#define SDMMC_EISTR_SD_SDIO_DATCRC_Msk        (_U_(0x1) << SDMMC_EISTR_SD_SDIO_DATCRC_Pos)         /**< (SDMMC_EISTR) Data CRC error Mask */
#define SDMMC_EISTR_SD_SDIO_DATCRC(value)     (SDMMC_EISTR_SD_SDIO_DATCRC_Msk & ((value) << SDMMC_EISTR_SD_SDIO_DATCRC_Pos))
#define SDMMC_EISTR_SD_SDIO_DATEND_Pos        _U_(6)                                               /**< (SDMMC_EISTR) Data End Bit Error Position */
#define SDMMC_EISTR_SD_SDIO_DATEND_Msk        (_U_(0x1) << SDMMC_EISTR_SD_SDIO_DATEND_Pos)         /**< (SDMMC_EISTR) Data End Bit Error Mask */
#define SDMMC_EISTR_SD_SDIO_DATEND(value)     (SDMMC_EISTR_SD_SDIO_DATEND_Msk & ((value) << SDMMC_EISTR_SD_SDIO_DATEND_Pos))
#define SDMMC_EISTR_SD_SDIO_CURLIM_Pos        _U_(7)                                               /**< (SDMMC_EISTR) Current Limit Error Position */
#define SDMMC_EISTR_SD_SDIO_CURLIM_Msk        (_U_(0x1) << SDMMC_EISTR_SD_SDIO_CURLIM_Pos)         /**< (SDMMC_EISTR) Current Limit Error Mask */
#define SDMMC_EISTR_SD_SDIO_CURLIM(value)     (SDMMC_EISTR_SD_SDIO_CURLIM_Msk & ((value) << SDMMC_EISTR_SD_SDIO_CURLIM_Pos))
#define SDMMC_EISTR_SD_SDIO_ACMD_Pos          _U_(8)                                               /**< (SDMMC_EISTR) Auto CMD Error Position */
#define SDMMC_EISTR_SD_SDIO_ACMD_Msk          (_U_(0x1) << SDMMC_EISTR_SD_SDIO_ACMD_Pos)           /**< (SDMMC_EISTR) Auto CMD Error Mask */
#define SDMMC_EISTR_SD_SDIO_ACMD(value)       (SDMMC_EISTR_SD_SDIO_ACMD_Msk & ((value) << SDMMC_EISTR_SD_SDIO_ACMD_Pos))
#define SDMMC_EISTR_SD_SDIO_ADMA_Pos          _U_(9)                                               /**< (SDMMC_EISTR) ADMA Error Position */
#define SDMMC_EISTR_SD_SDIO_ADMA_Msk          (_U_(0x1) << SDMMC_EISTR_SD_SDIO_ADMA_Pos)           /**< (SDMMC_EISTR) ADMA Error Mask */
#define SDMMC_EISTR_SD_SDIO_ADMA(value)       (SDMMC_EISTR_SD_SDIO_ADMA_Msk & ((value) << SDMMC_EISTR_SD_SDIO_ADMA_Pos))
#define SDMMC_EISTR_SD_SDIO_Msk               _U_(0x03FF)                                           /**< (SDMMC_EISTR_SD_SDIO) Register Mask  */

