virtualabs/cutcutgo/src/packs/ATSAMA5D27CD1G_DFP/component/sdmmc.h
/* E_MMC mode */
#define SDMMC_NISTER_E_MMC_CMDC_Pos           _U_(0)                                               /**< (SDMMC_NISTER) Command Complete Status Enable Position */
#define SDMMC_NISTER_E_MMC_CMDC_Msk           (_U_(0x1) << SDMMC_NISTER_E_MMC_CMDC_Pos)            /**< (SDMMC_NISTER) Command Complete Status Enable Mask */
#define SDMMC_NISTER_E_MMC_CMDC(value)        (SDMMC_NISTER_E_MMC_CMDC_Msk & ((value) << SDMMC_NISTER_E_MMC_CMDC_Pos))
#define   SDMMC_NISTER_E_MMC_CMDC_MASKED_Val  _U_(0x0)                                             /**< (SDMMC_NISTER) The CMDC status flag in SDMMC_NISTR is masked.  */
#define   SDMMC_NISTER_E_MMC_CMDC_ENABLED_Val _U_(0x1)                                             /**< (SDMMC_NISTER) The CMDC status flag in SDMMC_NISTR is enabled.  */
#define SDMMC_NISTER_E_MMC_CMDC_MASKED        (SDMMC_NISTER_E_MMC_CMDC_MASKED_Val << SDMMC_NISTER_E_MMC_CMDC_Pos) /**< (SDMMC_NISTER) The CMDC status flag in SDMMC_NISTR is masked. Position  */
#define SDMMC_NISTER_E_MMC_CMDC_ENABLED       (SDMMC_NISTER_E_MMC_CMDC_ENABLED_Val << SDMMC_NISTER_E_MMC_CMDC_Pos) /**< (SDMMC_NISTER) The CMDC status flag in SDMMC_NISTR is enabled. Position  */
#define SDMMC_NISTER_E_MMC_TRFC_Pos           _U_(1)                                               /**< (SDMMC_NISTER) Transfer Complete Status Enable Position */
#define SDMMC_NISTER_E_MMC_TRFC_Msk           (_U_(0x1) << SDMMC_NISTER_E_MMC_TRFC_Pos)            /**< (SDMMC_NISTER) Transfer Complete Status Enable Mask */
#define SDMMC_NISTER_E_MMC_TRFC(value)        (SDMMC_NISTER_E_MMC_TRFC_Msk & ((value) << SDMMC_NISTER_E_MMC_TRFC_Pos))
#define   SDMMC_NISTER_E_MMC_TRFC_MASKED_Val  _U_(0x0)                                             /**< (SDMMC_NISTER) The TRFC status flag in SDMMC_NISTR is masked.  */
#define   SDMMC_NISTER_E_MMC_TRFC_ENABLED_Val _U_(0x1)                                             /**< (SDMMC_NISTER) The TRFC status flag in SDMMC_NISTR is enabled.  */
#define SDMMC_NISTER_E_MMC_TRFC_MASKED        (SDMMC_NISTER_E_MMC_TRFC_MASKED_Val << SDMMC_NISTER_E_MMC_TRFC_Pos) /**< (SDMMC_NISTER) The TRFC status flag in SDMMC_NISTR is masked. Position  */
#define SDMMC_NISTER_E_MMC_TRFC_ENABLED       (SDMMC_NISTER_E_MMC_TRFC_ENABLED_Val << SDMMC_NISTER_E_MMC_TRFC_Pos) /**< (SDMMC_NISTER) The TRFC status flag in SDMMC_NISTR is enabled. Position  */
#define SDMMC_NISTER_E_MMC_BLKGE_Pos          _U_(2)                                               /**< (SDMMC_NISTER) Block Gap Event Status Enable Position */
#define SDMMC_NISTER_E_MMC_BLKGE_Msk          (_U_(0x1) << SDMMC_NISTER_E_MMC_BLKGE_Pos)           /**< (SDMMC_NISTER) Block Gap Event Status Enable Mask */
#define SDMMC_NISTER_E_MMC_BLKGE(value)       (SDMMC_NISTER_E_MMC_BLKGE_Msk & ((value) << SDMMC_NISTER_E_MMC_BLKGE_Pos))
#define   SDMMC_NISTER_E_MMC_BLKGE_MASKED_Val _U_(0x0)                                             /**< (SDMMC_NISTER) The BLKGE status flag in SDMMC_NISTR is masked.  */
#define   SDMMC_NISTER_E_MMC_BLKGE_ENABLED_Val _U_(0x1)                                             /**< (SDMMC_NISTER) The BLKGE status flag in SDMMC_NISTR is enabled.  */
#define SDMMC_NISTER_E_MMC_BLKGE_MASKED       (SDMMC_NISTER_E_MMC_BLKGE_MASKED_Val << SDMMC_NISTER_E_MMC_BLKGE_Pos) /**< (SDMMC_NISTER) The BLKGE status flag in SDMMC_NISTR is masked. Position  */
#define SDMMC_NISTER_E_MMC_BLKGE_ENABLED      (SDMMC_NISTER_E_MMC_BLKGE_ENABLED_Val << SDMMC_NISTER_E_MMC_BLKGE_Pos) /**< (SDMMC_NISTER) The BLKGE status flag in SDMMC_NISTR is enabled. Position  */
#define SDMMC_NISTER_E_MMC_DMAINT_Pos         _U_(3)                                               /**< (SDMMC_NISTER) DMA Interrupt Status Enable Position */
#define SDMMC_NISTER_E_MMC_DMAINT_Msk         (_U_(0x1) << SDMMC_NISTER_E_MMC_DMAINT_Pos)          /**< (SDMMC_NISTER) DMA Interrupt Status Enable Mask */
#define SDMMC_NISTER_E_MMC_DMAINT(value)      (SDMMC_NISTER_E_MMC_DMAINT_Msk & ((value) << SDMMC_NISTER_E_MMC_DMAINT_Pos))
#define   SDMMC_NISTER_E_MMC_DMAINT_MASKED_Val _U_(0x0)                                             /**< (SDMMC_NISTER) The DMAINT status flag in SDMMC_NISTR is masked.  */
#define   SDMMC_NISTER_E_MMC_DMAINT_ENABLED_Val _U_(0x1)                                             /**< (SDMMC_NISTER) The DMAINT status flag in SDMMC_NISTR is enabled.  */
#define SDMMC_NISTER_E_MMC_DMAINT_MASKED      (SDMMC_NISTER_E_MMC_DMAINT_MASKED_Val << SDMMC_NISTER_E_MMC_DMAINT_Pos) /**< (SDMMC_NISTER) The DMAINT status flag in SDMMC_NISTR is masked. Position  */
#define SDMMC_NISTER_E_MMC_DMAINT_ENABLED     (SDMMC_NISTER_E_MMC_DMAINT_ENABLED_Val << SDMMC_NISTER_E_MMC_DMAINT_Pos) /**< (SDMMC_NISTER) The DMAINT status flag in SDMMC_NISTR is enabled. Position  */
#define SDMMC_NISTER_E_MMC_BWRRDY_Pos         _U_(4)                                               /**< (SDMMC_NISTER) Buffer Write Ready Status Enable Position */
#define SDMMC_NISTER_E_MMC_BWRRDY_Msk         (_U_(0x1) << SDMMC_NISTER_E_MMC_BWRRDY_Pos)          /**< (SDMMC_NISTER) Buffer Write Ready Status Enable Mask */
#define SDMMC_NISTER_E_MMC_BWRRDY(value)      (SDMMC_NISTER_E_MMC_BWRRDY_Msk & ((value) << SDMMC_NISTER_E_MMC_BWRRDY_Pos))
#define   SDMMC_NISTER_E_MMC_BWRRDY_MASKED_Val _U_(0x0)                                             /**< (SDMMC_NISTER) The BWRRDY status flag in SDMMC_NISTR is masked.  */
#define   SDMMC_NISTER_E_MMC_BWRRDY_ENABLED_Val _U_(0x1)                                             /**< (SDMMC_NISTER) The BWRRDY status flag in SDMMC_NISTR is enabled.  */
#define SDMMC_NISTER_E_MMC_BWRRDY_MASKED      (SDMMC_NISTER_E_MMC_BWRRDY_MASKED_Val << SDMMC_NISTER_E_MMC_BWRRDY_Pos) /**< (SDMMC_NISTER) The BWRRDY status flag in SDMMC_NISTR is masked. Position  */
#define SDMMC_NISTER_E_MMC_BWRRDY_ENABLED     (SDMMC_NISTER_E_MMC_BWRRDY_ENABLED_Val << SDMMC_NISTER_E_MMC_BWRRDY_Pos) /**< (SDMMC_NISTER) The BWRRDY status flag in SDMMC_NISTR is enabled. Position  */
#define SDMMC_NISTER_E_MMC_BRDRDY_Pos         _U_(5)                                               /**< (SDMMC_NISTER) Buffer Read Ready Status Enable Position */
#define SDMMC_NISTER_E_MMC_BRDRDY_Msk         (_U_(0x1) << SDMMC_NISTER_E_MMC_BRDRDY_Pos)          /**< (SDMMC_NISTER) Buffer Read Ready Status Enable Mask */
#define SDMMC_NISTER_E_MMC_BRDRDY(value)      (SDMMC_NISTER_E_MMC_BRDRDY_Msk & ((value) << SDMMC_NISTER_E_MMC_BRDRDY_Pos))
#define   SDMMC_NISTER_E_MMC_BRDRDY_MASKED_Val _U_(0x0)                                             /**< (SDMMC_NISTER) The BRDRDY status flag in SDMMC_NISTR is masked.  */
#define   SDMMC_NISTER_E_MMC_BRDRDY_ENABLED_Val _U_(0x1)                                             /**< (SDMMC_NISTER) The BRDRDY status flag in SDMMC_NISTR is enabled.  */
#define SDMMC_NISTER_E_MMC_BRDRDY_MASKED      (SDMMC_NISTER_E_MMC_BRDRDY_MASKED_Val << SDMMC_NISTER_E_MMC_BRDRDY_Pos) /**< (SDMMC_NISTER) The BRDRDY status flag in SDMMC_NISTR is masked. Position  */
#define SDMMC_NISTER_E_MMC_BRDRDY_ENABLED     (SDMMC_NISTER_E_MMC_BRDRDY_ENABLED_Val << SDMMC_NISTER_E_MMC_BRDRDY_Pos) /**< (SDMMC_NISTER) The BRDRDY status flag in SDMMC_NISTR is enabled. Position  */
#define SDMMC_NISTER_E_MMC_BOOTAR_Pos         _U_(14)                                              /**< (SDMMC_NISTER) Boot Acknowledge Received Status Enable Position */
#define SDMMC_NISTER_E_MMC_BOOTAR_Msk         (_U_(0x1) << SDMMC_NISTER_E_MMC_BOOTAR_Pos)          /**< (SDMMC_NISTER) Boot Acknowledge Received Status Enable Mask */
#define SDMMC_NISTER_E_MMC_BOOTAR(value)      (SDMMC_NISTER_E_MMC_BOOTAR_Msk & ((value) << SDMMC_NISTER_E_MMC_BOOTAR_Pos))
#define   SDMMC_NISTER_E_MMC_BOOTAR_MASKED_Val _U_(0x0)                                             /**< (SDMMC_NISTER) The BOOTAR status flag in SDMMC_NISTR is masked.  */
#define   SDMMC_NISTER_E_MMC_BOOTAR_ENABLED_Val _U_(0x1)                                             /**< (SDMMC_NISTER) The BOOTAR status flag in SDMMC_NISTR is enabled.  */
#define SDMMC_NISTER_E_MMC_BOOTAR_MASKED      (SDMMC_NISTER_E_MMC_BOOTAR_MASKED_Val << SDMMC_NISTER_E_MMC_BOOTAR_Pos) /**< (SDMMC_NISTER) The BOOTAR status flag in SDMMC_NISTR is masked. Position  */
#define SDMMC_NISTER_E_MMC_BOOTAR_ENABLED     (SDMMC_NISTER_E_MMC_BOOTAR_ENABLED_Val << SDMMC_NISTER_E_MMC_BOOTAR_Pos) /**< (SDMMC_NISTER) The BOOTAR status flag in SDMMC_NISTR is enabled. Position  */
#define SDMMC_NISTER_E_MMC_Msk                _U_(0x403F)                                           /**< (SDMMC_NISTER_E_MMC) Register Mask  */


