virtualabs/cutcutgo/src/packs/ATSAMA5D27CD1G_DFP/component/sdmmc.h
/* E_MMC mode */
#define SDMMC_EISIER_E_MMC_CMDTEO_Pos         _U_(0)                                               /**< (SDMMC_EISIER) Command Timeout Error Signal Enable Position */
#define SDMMC_EISIER_E_MMC_CMDTEO_Msk         (_U_(0x1) << SDMMC_EISIER_E_MMC_CMDTEO_Pos)          /**< (SDMMC_EISIER) Command Timeout Error Signal Enable Mask */
#define SDMMC_EISIER_E_MMC_CMDTEO(value)      (SDMMC_EISIER_E_MMC_CMDTEO_Msk & ((value) << SDMMC_EISIER_E_MMC_CMDTEO_Pos))
#define   SDMMC_EISIER_E_MMC_CMDTEO_MASKED_Val _U_(0x0)                                             /**< (SDMMC_EISIER) No interrupt is generated when the CMDTEO status rises in SDMMC_EISTR.  */
#define   SDMMC_EISIER_E_MMC_CMDTEO_ENABLED_Val _U_(0x1)                                             /**< (SDMMC_EISIER) An interrupt is generated when the CMDTEO status rises in SDMMC_EISTR.  */
#define SDMMC_EISIER_E_MMC_CMDTEO_MASKED      (SDMMC_EISIER_E_MMC_CMDTEO_MASKED_Val << SDMMC_EISIER_E_MMC_CMDTEO_Pos) /**< (SDMMC_EISIER) No interrupt is generated when the CMDTEO status rises in SDMMC_EISTR. Position  */
#define SDMMC_EISIER_E_MMC_CMDTEO_ENABLED     (SDMMC_EISIER_E_MMC_CMDTEO_ENABLED_Val << SDMMC_EISIER_E_MMC_CMDTEO_Pos) /**< (SDMMC_EISIER) An interrupt is generated when the CMDTEO status rises in SDMMC_EISTR. Position  */
#define SDMMC_EISIER_E_MMC_CMDCRC_Pos         _U_(1)                                               /**< (SDMMC_EISIER) Command CRC Error Signal Enable Position */
#define SDMMC_EISIER_E_MMC_CMDCRC_Msk         (_U_(0x1) << SDMMC_EISIER_E_MMC_CMDCRC_Pos)          /**< (SDMMC_EISIER) Command CRC Error Signal Enable Mask */
#define SDMMC_EISIER_E_MMC_CMDCRC(value)      (SDMMC_EISIER_E_MMC_CMDCRC_Msk & ((value) << SDMMC_EISIER_E_MMC_CMDCRC_Pos))
#define   SDMMC_EISIER_E_MMC_CMDCRC_MASKED_Val _U_(0x0)                                             /**< (SDMMC_EISIER) No interrupt is generated when the CDMCRC status rises in SDMMC_EISTR.  */
#define   SDMMC_EISIER_E_MMC_CMDCRC_ENABLED_Val _U_(0x1)                                             /**< (SDMMC_EISIER) An interrupt is generated when the CMDCRC status rises in SDMMC_EISTR.  */
#define SDMMC_EISIER_E_MMC_CMDCRC_MASKED      (SDMMC_EISIER_E_MMC_CMDCRC_MASKED_Val << SDMMC_EISIER_E_MMC_CMDCRC_Pos) /**< (SDMMC_EISIER) No interrupt is generated when the CDMCRC status rises in SDMMC_EISTR. Position  */
#define SDMMC_EISIER_E_MMC_CMDCRC_ENABLED     (SDMMC_EISIER_E_MMC_CMDCRC_ENABLED_Val << SDMMC_EISIER_E_MMC_CMDCRC_Pos) /**< (SDMMC_EISIER) An interrupt is generated when the CMDCRC status rises in SDMMC_EISTR. Position  */
#define SDMMC_EISIER_E_MMC_CMDEND_Pos         _U_(2)                                               /**< (SDMMC_EISIER) Command End Bit Error Signal Enable Position */
#define SDMMC_EISIER_E_MMC_CMDEND_Msk         (_U_(0x1) << SDMMC_EISIER_E_MMC_CMDEND_Pos)          /**< (SDMMC_EISIER) Command End Bit Error Signal Enable Mask */
#define SDMMC_EISIER_E_MMC_CMDEND(value)      (SDMMC_EISIER_E_MMC_CMDEND_Msk & ((value) << SDMMC_EISIER_E_MMC_CMDEND_Pos))
#define   SDMMC_EISIER_E_MMC_CMDEND_MASKED_Val _U_(0x0)                                             /**< (SDMMC_EISIER) No interrupt is generated when the CMDEND status rises in SDMMC_EISTR.  */
#define   SDMMC_EISIER_E_MMC_CMDEND_ENABLED_Val _U_(0x1)                                             /**< (SDMMC_EISIER) An interrupt is generated when the CMDEND status rises in SDMMC_EISTR.  */
#define SDMMC_EISIER_E_MMC_CMDEND_MASKED      (SDMMC_EISIER_E_MMC_CMDEND_MASKED_Val << SDMMC_EISIER_E_MMC_CMDEND_Pos) /**< (SDMMC_EISIER) No interrupt is generated when the CMDEND status rises in SDMMC_EISTR. Position  */
#define SDMMC_EISIER_E_MMC_CMDEND_ENABLED     (SDMMC_EISIER_E_MMC_CMDEND_ENABLED_Val << SDMMC_EISIER_E_MMC_CMDEND_Pos) /**< (SDMMC_EISIER) An interrupt is generated when the CMDEND status rises in SDMMC_EISTR. Position  */
#define SDMMC_EISIER_E_MMC_CMDIDX_Pos         _U_(3)                                               /**< (SDMMC_EISIER) Command Index Error Signal Enable Position */
#define SDMMC_EISIER_E_MMC_CMDIDX_Msk         (_U_(0x1) << SDMMC_EISIER_E_MMC_CMDIDX_Pos)          /**< (SDMMC_EISIER) Command Index Error Signal Enable Mask */
#define SDMMC_EISIER_E_MMC_CMDIDX(value)      (SDMMC_EISIER_E_MMC_CMDIDX_Msk & ((value) << SDMMC_EISIER_E_MMC_CMDIDX_Pos))
#define   SDMMC_EISIER_E_MMC_CMDIDX_MASKED_Val _U_(0x0)                                             /**< (SDMMC_EISIER) No interrupt is generated when the CMDIDX status rises in SDMMC_EISTR.  */
#define   SDMMC_EISIER_E_MMC_CMDIDX_ENABLED_Val _U_(0x1)                                             /**< (SDMMC_EISIER) An interrupt is generated when the CMDIDX status rises in SDMMC_EISTR.  */
#define SDMMC_EISIER_E_MMC_CMDIDX_MASKED      (SDMMC_EISIER_E_MMC_CMDIDX_MASKED_Val << SDMMC_EISIER_E_MMC_CMDIDX_Pos) /**< (SDMMC_EISIER) No interrupt is generated when the CMDIDX status rises in SDMMC_EISTR. Position  */
#define SDMMC_EISIER_E_MMC_CMDIDX_ENABLED     (SDMMC_EISIER_E_MMC_CMDIDX_ENABLED_Val << SDMMC_EISIER_E_MMC_CMDIDX_Pos) /**< (SDMMC_EISIER) An interrupt is generated when the CMDIDX status rises in SDMMC_EISTR. Position  */
#define SDMMC_EISIER_E_MMC_DATTEO_Pos         _U_(4)                                               /**< (SDMMC_EISIER) Data Timeout Error Signal Enable Position */
#define SDMMC_EISIER_E_MMC_DATTEO_Msk         (_U_(0x1) << SDMMC_EISIER_E_MMC_DATTEO_Pos)          /**< (SDMMC_EISIER) Data Timeout Error Signal Enable Mask */
#define SDMMC_EISIER_E_MMC_DATTEO(value)      (SDMMC_EISIER_E_MMC_DATTEO_Msk & ((value) << SDMMC_EISIER_E_MMC_DATTEO_Pos))
#define   SDMMC_EISIER_E_MMC_DATTEO_MASKED_Val _U_(0x0)                                             /**< (SDMMC_EISIER) No interrupt is generated when the DATTEO status rises in SDMMC_EISTR.  */
#define   SDMMC_EISIER_E_MMC_DATTEO_ENABLED_Val _U_(0x1)                                             /**< (SDMMC_EISIER) An interrupt is generated when the DATTEO status rises in SDMMC_EISTR.  */
#define SDMMC_EISIER_E_MMC_DATTEO_MASKED      (SDMMC_EISIER_E_MMC_DATTEO_MASKED_Val << SDMMC_EISIER_E_MMC_DATTEO_Pos) /**< (SDMMC_EISIER) No interrupt is generated when the DATTEO status rises in SDMMC_EISTR. Position  */
#define SDMMC_EISIER_E_MMC_DATTEO_ENABLED     (SDMMC_EISIER_E_MMC_DATTEO_ENABLED_Val << SDMMC_EISIER_E_MMC_DATTEO_Pos) /**< (SDMMC_EISIER) An interrupt is generated when the DATTEO status rises in SDMMC_EISTR. Position  */
#define SDMMC_EISIER_E_MMC_DATCRC_Pos         _U_(5)                                               /**< (SDMMC_EISIER) Data CRC Error Signal Enable Position */
#define SDMMC_EISIER_E_MMC_DATCRC_Msk         (_U_(0x1) << SDMMC_EISIER_E_MMC_DATCRC_Pos)          /**< (SDMMC_EISIER) Data CRC Error Signal Enable Mask */
#define SDMMC_EISIER_E_MMC_DATCRC(value)      (SDMMC_EISIER_E_MMC_DATCRC_Msk & ((value) << SDMMC_EISIER_E_MMC_DATCRC_Pos))
#define   SDMMC_EISIER_E_MMC_DATCRC_MASKED_Val _U_(0x0)                                             /**< (SDMMC_EISIER) No interrupt is generated when the DATCRC status rises in SDMMC_EISTR.  */
#define   SDMMC_EISIER_E_MMC_DATCRC_ENABLED_Val _U_(0x1)                                             /**< (SDMMC_EISIER) An interrupt is generated when the DATCRC status rises in SDMMC_EISTR.  */
#define SDMMC_EISIER_E_MMC_DATCRC_MASKED      (SDMMC_EISIER_E_MMC_DATCRC_MASKED_Val << SDMMC_EISIER_E_MMC_DATCRC_Pos) /**< (SDMMC_EISIER) No interrupt is generated when the DATCRC status rises in SDMMC_EISTR. Position  */
#define SDMMC_EISIER_E_MMC_DATCRC_ENABLED     (SDMMC_EISIER_E_MMC_DATCRC_ENABLED_Val << SDMMC_EISIER_E_MMC_DATCRC_Pos) /**< (SDMMC_EISIER) An interrupt is generated when the DATCRC status rises in SDMMC_EISTR. Position  */
#define SDMMC_EISIER_E_MMC_DATEND_Pos         _U_(6)                                               /**< (SDMMC_EISIER) Data End Bit Error Signal Enable Position */
#define SDMMC_EISIER_E_MMC_DATEND_Msk         (_U_(0x1) << SDMMC_EISIER_E_MMC_DATEND_Pos)          /**< (SDMMC_EISIER) Data End Bit Error Signal Enable Mask */
#define SDMMC_EISIER_E_MMC_DATEND(value)      (SDMMC_EISIER_E_MMC_DATEND_Msk & ((value) << SDMMC_EISIER_E_MMC_DATEND_Pos))
#define   SDMMC_EISIER_E_MMC_DATEND_MASKED_Val _U_(0x0)                                             /**< (SDMMC_EISIER) No interrupt is generated when the DATEND status rises in SDMMC_EISTR.  */
#define   SDMMC_EISIER_E_MMC_DATEND_ENABLED_Val _U_(0x1)                                             /**< (SDMMC_EISIER) An interrupt is generated when the DATEND status rises in SDMMC_EISTR.  */
#define SDMMC_EISIER_E_MMC_DATEND_MASKED      (SDMMC_EISIER_E_MMC_DATEND_MASKED_Val << SDMMC_EISIER_E_MMC_DATEND_Pos) /**< (SDMMC_EISIER) No interrupt is generated when the DATEND status rises in SDMMC_EISTR. Position  */
#define SDMMC_EISIER_E_MMC_DATEND_ENABLED     (SDMMC_EISIER_E_MMC_DATEND_ENABLED_Val << SDMMC_EISIER_E_MMC_DATEND_Pos) /**< (SDMMC_EISIER) An interrupt is generated when the DATEND status rises in SDMMC_EISTR. Position  */
#define SDMMC_EISIER_E_MMC_CURLIM_Pos         _U_(7)                                               /**< (SDMMC_EISIER) Current Limit Error Signal Enable Position */
#define SDMMC_EISIER_E_MMC_CURLIM_Msk         (_U_(0x1) << SDMMC_EISIER_E_MMC_CURLIM_Pos)          /**< (SDMMC_EISIER) Current Limit Error Signal Enable Mask */
#define SDMMC_EISIER_E_MMC_CURLIM(value)      (SDMMC_EISIER_E_MMC_CURLIM_Msk & ((value) << SDMMC_EISIER_E_MMC_CURLIM_Pos))
#define   SDMMC_EISIER_E_MMC_CURLIM_MASKED_Val _U_(0x0)                                             /**< (SDMMC_EISIER) No interrupt is generated when the CURLIM status rises in SDMMC_EISTR.  */
#define   SDMMC_EISIER_E_MMC_CURLIM_ENABLED_Val _U_(0x1)                                             /**< (SDMMC_EISIER) An interrupt is generated when the CURLIM status rises in SDMMC_EISTR.  */
#define SDMMC_EISIER_E_MMC_CURLIM_MASKED      (SDMMC_EISIER_E_MMC_CURLIM_MASKED_Val << SDMMC_EISIER_E_MMC_CURLIM_Pos) /**< (SDMMC_EISIER) No interrupt is generated when the CURLIM status rises in SDMMC_EISTR. Position  */
#define SDMMC_EISIER_E_MMC_CURLIM_ENABLED     (SDMMC_EISIER_E_MMC_CURLIM_ENABLED_Val << SDMMC_EISIER_E_MMC_CURLIM_Pos) /**< (SDMMC_EISIER) An interrupt is generated when the CURLIM status rises in SDMMC_EISTR. Position  */
#define SDMMC_EISIER_E_MMC_ACMD_Pos           _U_(8)                                               /**< (SDMMC_EISIER) Auto CMD Error Signal Enable Position */
#define SDMMC_EISIER_E_MMC_ACMD_Msk           (_U_(0x1) << SDMMC_EISIER_E_MMC_ACMD_Pos)            /**< (SDMMC_EISIER) Auto CMD Error Signal Enable Mask */
#define SDMMC_EISIER_E_MMC_ACMD(value)        (SDMMC_EISIER_E_MMC_ACMD_Msk & ((value) << SDMMC_EISIER_E_MMC_ACMD_Pos))
#define   SDMMC_EISIER_E_MMC_ACMD_MASKED_Val  _U_(0x0)                                             /**< (SDMMC_EISIER) No interrupt is generated when the ACMD status rises in SDMMC_EISTR.  */
#define   SDMMC_EISIER_E_MMC_ACMD_ENABLED_Val _U_(0x1)                                             /**< (SDMMC_EISIER) An interrupt is generated when the ACMD status rises in SDMMC_EISTR.  */
#define SDMMC_EISIER_E_MMC_ACMD_MASKED        (SDMMC_EISIER_E_MMC_ACMD_MASKED_Val << SDMMC_EISIER_E_MMC_ACMD_Pos) /**< (SDMMC_EISIER) No interrupt is generated when the ACMD status rises in SDMMC_EISTR. Position  */
#define SDMMC_EISIER_E_MMC_ACMD_ENABLED       (SDMMC_EISIER_E_MMC_ACMD_ENABLED_Val << SDMMC_EISIER_E_MMC_ACMD_Pos) /**< (SDMMC_EISIER) An interrupt is generated when the ACMD status rises in SDMMC_EISTR. Position  */
#define SDMMC_EISIER_E_MMC_ADMA_Pos           _U_(9)                                               /**< (SDMMC_EISIER) ADMA Error Signal Enable Position */
#define SDMMC_EISIER_E_MMC_ADMA_Msk           (_U_(0x1) << SDMMC_EISIER_E_MMC_ADMA_Pos)            /**< (SDMMC_EISIER) ADMA Error Signal Enable Mask */
#define SDMMC_EISIER_E_MMC_ADMA(value)        (SDMMC_EISIER_E_MMC_ADMA_Msk & ((value) << SDMMC_EISIER_E_MMC_ADMA_Pos))
#define   SDMMC_EISIER_E_MMC_ADMA_MASKED_Val  _U_(0x0)                                             /**< (SDMMC_EISIER) No interrupt is generated when the ADMA status rises in SDMMC_EISTR.  */
#define   SDMMC_EISIER_E_MMC_ADMA_ENABLED_Val _U_(0x1)                                             /**< (SDMMC_EISIER) An interrupt is generated when the ADMA status rises in SDMMC_EISTR.  */
#define SDMMC_EISIER_E_MMC_ADMA_MASKED        (SDMMC_EISIER_E_MMC_ADMA_MASKED_Val << SDMMC_EISIER_E_MMC_ADMA_Pos) /**< (SDMMC_EISIER) No interrupt is generated when the ADMA status rises in SDMMC_EISTR. Position  */
#define SDMMC_EISIER_E_MMC_ADMA_ENABLED       (SDMMC_EISIER_E_MMC_ADMA_ENABLED_Val << SDMMC_EISIER_E_MMC_ADMA_Pos) /**< (SDMMC_EISIER) An interrupt is generated when the ADMA status rises in SDMMC_EISTR. Position  */
#define SDMMC_EISIER_E_MMC_BOOTAE_Pos         _U_(12)                                              /**< (SDMMC_EISIER) Boot Acknowledge Error Signal Enable Position */
#define SDMMC_EISIER_E_MMC_BOOTAE_Msk         (_U_(0x1) << SDMMC_EISIER_E_MMC_BOOTAE_Pos)          /**< (SDMMC_EISIER) Boot Acknowledge Error Signal Enable Mask */
#define SDMMC_EISIER_E_MMC_BOOTAE(value)      (SDMMC_EISIER_E_MMC_BOOTAE_Msk & ((value) << SDMMC_EISIER_E_MMC_BOOTAE_Pos))
#define   SDMMC_EISIER_E_MMC_BOOTAE_MASKED_Val _U_(0x0)                                             /**< (SDMMC_EISIER) No interrupt is generated when the BOOTAE status rises in SDMMC_EISTR.  */
#define   SDMMC_EISIER_E_MMC_BOOTAE_ENABLED_Val _U_(0x1)                                             /**< (SDMMC_EISIER) An interrupt is generated when the BOOTAE status rises in SDMMC_EISTR.  */
#define SDMMC_EISIER_E_MMC_BOOTAE_MASKED      (SDMMC_EISIER_E_MMC_BOOTAE_MASKED_Val << SDMMC_EISIER_E_MMC_BOOTAE_Pos) /**< (SDMMC_EISIER) No interrupt is generated when the BOOTAE status rises in SDMMC_EISTR. Position  */
#define SDMMC_EISIER_E_MMC_BOOTAE_ENABLED     (SDMMC_EISIER_E_MMC_BOOTAE_ENABLED_Val << SDMMC_EISIER_E_MMC_BOOTAE_Pos) /**< (SDMMC_EISIER) An interrupt is generated when the BOOTAE status rises in SDMMC_EISTR. Position  */
#define SDMMC_EISIER_E_MMC_Msk                _U_(0x13FF)                                           /**< (SDMMC_EISIER_E_MMC) Register Mask  */


