virtualabs/cutcutgo/src/packs/ATSAMA5D27CD1G_DFP/component/sdmmc.h
/* -------- SDMMC_ACESR : (SDMMC Offset: 0x3C) ( R/ 16) Auto CMD Error Status Register -------- */
#define SDMMC_ACESR_ACMD12NE_Pos              _U_(0)                                               /**< (SDMMC_ACESR) Auto CMD12 Not Executed Position */
#define SDMMC_ACESR_ACMD12NE_Msk              (_U_(0x1) << SDMMC_ACESR_ACMD12NE_Pos)               /**< (SDMMC_ACESR) Auto CMD12 Not Executed Mask */
#define SDMMC_ACESR_ACMD12NE(value)           (SDMMC_ACESR_ACMD12NE_Msk & ((value) << SDMMC_ACESR_ACMD12NE_Pos))
#define SDMMC_ACESR_ACMDTEO_Pos               _U_(1)                                               /**< (SDMMC_ACESR) Auto CMD Timeout Error Position */
#define SDMMC_ACESR_ACMDTEO_Msk               (_U_(0x1) << SDMMC_ACESR_ACMDTEO_Pos)                /**< (SDMMC_ACESR) Auto CMD Timeout Error Mask */
#define SDMMC_ACESR_ACMDTEO(value)            (SDMMC_ACESR_ACMDTEO_Msk & ((value) << SDMMC_ACESR_ACMDTEO_Pos))
#define SDMMC_ACESR_ACMDCRC_Pos               _U_(2)                                               /**< (SDMMC_ACESR) Auto CMD CRC Error Position */
#define SDMMC_ACESR_ACMDCRC_Msk               (_U_(0x1) << SDMMC_ACESR_ACMDCRC_Pos)                /**< (SDMMC_ACESR) Auto CMD CRC Error Mask */
#define SDMMC_ACESR_ACMDCRC(value)            (SDMMC_ACESR_ACMDCRC_Msk & ((value) << SDMMC_ACESR_ACMDCRC_Pos))
#define SDMMC_ACESR_ACMDEND_Pos               _U_(3)                                               /**< (SDMMC_ACESR) Auto CMD End Bit Error Position */
#define SDMMC_ACESR_ACMDEND_Msk               (_U_(0x1) << SDMMC_ACESR_ACMDEND_Pos)                /**< (SDMMC_ACESR) Auto CMD End Bit Error Mask */
#define SDMMC_ACESR_ACMDEND(value)            (SDMMC_ACESR_ACMDEND_Msk & ((value) << SDMMC_ACESR_ACMDEND_Pos))
#define SDMMC_ACESR_ACMDIDX_Pos               _U_(4)                                               /**< (SDMMC_ACESR) Auto CMD Index Error Position */
#define SDMMC_ACESR_ACMDIDX_Msk               (_U_(0x1) << SDMMC_ACESR_ACMDIDX_Pos)                /**< (SDMMC_ACESR) Auto CMD Index Error Mask */
#define SDMMC_ACESR_ACMDIDX(value)            (SDMMC_ACESR_ACMDIDX_Msk & ((value) << SDMMC_ACESR_ACMDIDX_Pos))
#define SDMMC_ACESR_CMDNI_Pos                 _U_(7)                                               /**< (SDMMC_ACESR) Command Not Issued by Auto CMD12 Error Position */
#define SDMMC_ACESR_CMDNI_Msk                 (_U_(0x1) << SDMMC_ACESR_CMDNI_Pos)                  /**< (SDMMC_ACESR) Command Not Issued by Auto CMD12 Error Mask */
#define SDMMC_ACESR_CMDNI(value)              (SDMMC_ACESR_CMDNI_Msk & ((value) << SDMMC_ACESR_CMDNI_Pos))
#define SDMMC_ACESR_Msk                       _U_(0x009F)                                          /**< (SDMMC_ACESR) Register Mask  */


/* -------- SDMMC_HC2R : (SDMMC Offset: 0x3E) (R/W 16) Host Control 2 Register -------- */
#define SDMMC_HC2R_Msk                        _U_(0x0000)                                          /**< (SDMMC_HC2R) Register Mask  */

/* SD_SDIO mode */
#define SDMMC_HC2R_SD_SDIO_UHSMS_Pos          _U_(0)                                               /**< (SDMMC_HC2R) UHS Mode Select Position */
#define SDMMC_HC2R_SD_SDIO_UHSMS_Msk          (_U_(0x7) << SDMMC_HC2R_SD_SDIO_UHSMS_Pos)           /**< (SDMMC_HC2R) UHS Mode Select Mask */
#define SDMMC_HC2R_SD_SDIO_UHSMS(value)       (SDMMC_HC2R_SD_SDIO_UHSMS_Msk & ((value) << SDMMC_HC2R_SD_SDIO_UHSMS_Pos))
#define   SDMMC_HC2R_SD_SDIO_UHSMS_SDR12_Val  _U_(0x0)                                             /**< (SDMMC_HC2R) UHS SDR12 Mode  */
#define   SDMMC_HC2R_SD_SDIO_UHSMS_SDR25_Val  _U_(0x1)                                             /**< (SDMMC_HC2R) UHS SDR25 Mode  */
#define   SDMMC_HC2R_SD_SDIO_UHSMS_SDR50_Val  _U_(0x2)                                             /**< (SDMMC_HC2R) UHS SDR50 Mode  */
#define   SDMMC_HC2R_SD_SDIO_UHSMS_SDR104_Val _U_(0x3)                                             /**< (SDMMC_HC2R) UHS SDR104 Mode  */
#define   SDMMC_HC2R_SD_SDIO_UHSMS_DDR50_Val  _U_(0x4)                                             /**< (SDMMC_HC2R) UHS DDR50 Mode  */
#define SDMMC_HC2R_SD_SDIO_UHSMS_SDR12        (SDMMC_HC2R_SD_SDIO_UHSMS_SDR12_Val << SDMMC_HC2R_SD_SDIO_UHSMS_Pos) /**< (SDMMC_HC2R) UHS SDR12 Mode Position  */
#define SDMMC_HC2R_SD_SDIO_UHSMS_SDR25        (SDMMC_HC2R_SD_SDIO_UHSMS_SDR25_Val << SDMMC_HC2R_SD_SDIO_UHSMS_Pos) /**< (SDMMC_HC2R) UHS SDR25 Mode Position  */
#define SDMMC_HC2R_SD_SDIO_UHSMS_SDR50        (SDMMC_HC2R_SD_SDIO_UHSMS_SDR50_Val << SDMMC_HC2R_SD_SDIO_UHSMS_Pos) /**< (SDMMC_HC2R) UHS SDR50 Mode Position  */
#define SDMMC_HC2R_SD_SDIO_UHSMS_SDR104       (SDMMC_HC2R_SD_SDIO_UHSMS_SDR104_Val << SDMMC_HC2R_SD_SDIO_UHSMS_Pos) /**< (SDMMC_HC2R) UHS SDR104 Mode Position  */
#define SDMMC_HC2R_SD_SDIO_UHSMS_DDR50        (SDMMC_HC2R_SD_SDIO_UHSMS_DDR50_Val << SDMMC_HC2R_SD_SDIO_UHSMS_Pos) /**< (SDMMC_HC2R) UHS DDR50 Mode Position  */
#define SDMMC_HC2R_SD_SDIO_VS18EN_Pos         _U_(3)                                               /**< (SDMMC_HC2R) 1.8V Signaling Enable Position */
#define SDMMC_HC2R_SD_SDIO_VS18EN_Msk         (_U_(0x1) << SDMMC_HC2R_SD_SDIO_VS18EN_Pos)          /**< (SDMMC_HC2R) 1.8V Signaling Enable Mask */
#define SDMMC_HC2R_SD_SDIO_VS18EN(value)      (SDMMC_HC2R_SD_SDIO_VS18EN_Msk & ((value) << SDMMC_HC2R_SD_SDIO_VS18EN_Pos))
#define SDMMC_HC2R_SD_SDIO_DRVSEL_Pos         _U_(4)                                               /**< (SDMMC_HC2R) Driver Strength Select Position */
#define SDMMC_HC2R_SD_SDIO_DRVSEL_Msk         (_U_(0x3) << SDMMC_HC2R_SD_SDIO_DRVSEL_Pos)          /**< (SDMMC_HC2R) Driver Strength Select Mask */
#define SDMMC_HC2R_SD_SDIO_DRVSEL(value)      (SDMMC_HC2R_SD_SDIO_DRVSEL_Msk & ((value) << SDMMC_HC2R_SD_SDIO_DRVSEL_Pos))
#define   SDMMC_HC2R_SD_SDIO_DRVSEL_TYPEB_Val _U_(0x0)                                             /**< (SDMMC_HC2R) Driver Type B is selected (Default)  */
#define   SDMMC_HC2R_SD_SDIO_DRVSEL_TYPEA_Val _U_(0x1)                                             /**< (SDMMC_HC2R) Driver Type A is selected  */
#define   SDMMC_HC2R_SD_SDIO_DRVSEL_TYPEC_Val _U_(0x2)                                             /**< (SDMMC_HC2R) Driver Type C is selected  */
#define   SDMMC_HC2R_SD_SDIO_DRVSEL_TYPED_Val _U_(0x3)                                             /**< (SDMMC_HC2R) Driver Type D is selected  */
#define SDMMC_HC2R_SD_SDIO_DRVSEL_TYPEB       (SDMMC_HC2R_SD_SDIO_DRVSEL_TYPEB_Val << SDMMC_HC2R_SD_SDIO_DRVSEL_Pos) /**< (SDMMC_HC2R) Driver Type B is selected (Default) Position  */
#define SDMMC_HC2R_SD_SDIO_DRVSEL_TYPEA       (SDMMC_HC2R_SD_SDIO_DRVSEL_TYPEA_Val << SDMMC_HC2R_SD_SDIO_DRVSEL_Pos) /**< (SDMMC_HC2R) Driver Type A is selected Position  */
#define SDMMC_HC2R_SD_SDIO_DRVSEL_TYPEC       (SDMMC_HC2R_SD_SDIO_DRVSEL_TYPEC_Val << SDMMC_HC2R_SD_SDIO_DRVSEL_Pos) /**< (SDMMC_HC2R) Driver Type C is selected Position  */
#define SDMMC_HC2R_SD_SDIO_DRVSEL_TYPED       (SDMMC_HC2R_SD_SDIO_DRVSEL_TYPED_Val << SDMMC_HC2R_SD_SDIO_DRVSEL_Pos) /**< (SDMMC_HC2R) Driver Type D is selected Position  */
#define SDMMC_HC2R_SD_SDIO_EXTUN_Pos          _U_(6)                                               /**< (SDMMC_HC2R) Execute Tuning Position */
#define SDMMC_HC2R_SD_SDIO_EXTUN_Msk          (_U_(0x1) << SDMMC_HC2R_SD_SDIO_EXTUN_Pos)           /**< (SDMMC_HC2R) Execute Tuning Mask */
#define SDMMC_HC2R_SD_SDIO_EXTUN(value)       (SDMMC_HC2R_SD_SDIO_EXTUN_Msk & ((value) << SDMMC_HC2R_SD_SDIO_EXTUN_Pos))
#define SDMMC_HC2R_SD_SDIO_SCLKSEL_Pos        _U_(7)                                               /**< (SDMMC_HC2R) Sampling Clock Select Position */
#define SDMMC_HC2R_SD_SDIO_SCLKSEL_Msk        (_U_(0x1) << SDMMC_HC2R_SD_SDIO_SCLKSEL_Pos)         /**< (SDMMC_HC2R) Sampling Clock Select Mask */
#define SDMMC_HC2R_SD_SDIO_SCLKSEL(value)     (SDMMC_HC2R_SD_SDIO_SCLKSEL_Msk & ((value) << SDMMC_HC2R_SD_SDIO_SCLKSEL_Pos))
#define SDMMC_HC2R_SD_SDIO_ASINTEN_Pos        _U_(14)                                              /**< (SDMMC_HC2R) Asynchronous Interrupt Enable Position */
#define SDMMC_HC2R_SD_SDIO_ASINTEN_Msk        (_U_(0x1) << SDMMC_HC2R_SD_SDIO_ASINTEN_Pos)         /**< (SDMMC_HC2R) Asynchronous Interrupt Enable Mask */
#define SDMMC_HC2R_SD_SDIO_ASINTEN(value)     (SDMMC_HC2R_SD_SDIO_ASINTEN_Msk & ((value) << SDMMC_HC2R_SD_SDIO_ASINTEN_Pos))
#define SDMMC_HC2R_SD_SDIO_PVALEN_Pos         _U_(15)                                              /**< (SDMMC_HC2R) Preset Value Enable Position */
#define SDMMC_HC2R_SD_SDIO_PVALEN_Msk         (_U_(0x1) << SDMMC_HC2R_SD_SDIO_PVALEN_Pos)          /**< (SDMMC_HC2R) Preset Value Enable Mask */
#define SDMMC_HC2R_SD_SDIO_PVALEN(value)      (SDMMC_HC2R_SD_SDIO_PVALEN_Msk & ((value) << SDMMC_HC2R_SD_SDIO_PVALEN_Pos))
#define SDMMC_HC2R_SD_SDIO_Msk                _U_(0xC0FF)                                           /**< (SDMMC_HC2R_SD_SDIO) Register Mask  */

