virtualabs/cutcutgo/src/packs/ATSAMA5D27CD1G_DFP/component/sdmmc.h
/* -------- SDMMC_MCCAR : (SDMMC Offset: 0x48) (R/W 32) Maximum Current Capabilities Register -------- */
#define SDMMC_MCCAR_MAXCUR33V_Pos             _U_(0)                                               /**< (SDMMC_MCCAR) Maximum Current for 3.3V Position */
#define SDMMC_MCCAR_MAXCUR33V_Msk             (_U_(0xFF) << SDMMC_MCCAR_MAXCUR33V_Pos)             /**< (SDMMC_MCCAR) Maximum Current for 3.3V Mask */
#define SDMMC_MCCAR_MAXCUR33V(value)          (SDMMC_MCCAR_MAXCUR33V_Msk & ((value) << SDMMC_MCCAR_MAXCUR33V_Pos))
#define SDMMC_MCCAR_MAXCUR30V_Pos             _U_(8)                                               /**< (SDMMC_MCCAR) Maximum Current for 3.0V Position */
#define SDMMC_MCCAR_MAXCUR30V_Msk             (_U_(0xFF) << SDMMC_MCCAR_MAXCUR30V_Pos)             /**< (SDMMC_MCCAR) Maximum Current for 3.0V Mask */
#define SDMMC_MCCAR_MAXCUR30V(value)          (SDMMC_MCCAR_MAXCUR30V_Msk & ((value) << SDMMC_MCCAR_MAXCUR30V_Pos))
#define SDMMC_MCCAR_MAXCUR18V_Pos             _U_(16)                                              /**< (SDMMC_MCCAR) Maximum Current for 1.8V Position */
#define SDMMC_MCCAR_MAXCUR18V_Msk             (_U_(0xFF) << SDMMC_MCCAR_MAXCUR18V_Pos)             /**< (SDMMC_MCCAR) Maximum Current for 1.8V Mask */
#define SDMMC_MCCAR_MAXCUR18V(value)          (SDMMC_MCCAR_MAXCUR18V_Msk & ((value) << SDMMC_MCCAR_MAXCUR18V_Pos))
#define SDMMC_MCCAR_Msk                       _U_(0x00FFFFFF)                                      /**< (SDMMC_MCCAR) Register Mask  */


/* -------- SDMMC_FERACES : (SDMMC Offset: 0x50) ( /W 16) Force Event Register for Auto CMD Error Status -------- */
#define SDMMC_FERACES_ACMD12NE_Pos            _U_(0)                                               /**< (SDMMC_FERACES) Force Event for Auto CMD12 Not Executed Position */
#define SDMMC_FERACES_ACMD12NE_Msk            (_U_(0x1) << SDMMC_FERACES_ACMD12NE_Pos)             /**< (SDMMC_FERACES) Force Event for Auto CMD12 Not Executed Mask */
#define SDMMC_FERACES_ACMD12NE(value)         (SDMMC_FERACES_ACMD12NE_Msk & ((value) << SDMMC_FERACES_ACMD12NE_Pos))
#define SDMMC_FERACES_ACMDTEO_Pos             _U_(1)                                               /**< (SDMMC_FERACES) Force Event for Auto CMD Timeout Error Position */
#define SDMMC_FERACES_ACMDTEO_Msk             (_U_(0x1) << SDMMC_FERACES_ACMDTEO_Pos)              /**< (SDMMC_FERACES) Force Event for Auto CMD Timeout Error Mask */
#define SDMMC_FERACES_ACMDTEO(value)          (SDMMC_FERACES_ACMDTEO_Msk & ((value) << SDMMC_FERACES_ACMDTEO_Pos))
#define SDMMC_FERACES_ACMDCRC_Pos             _U_(2)                                               /**< (SDMMC_FERACES) Force Event for Auto CMD CRC Error Position */
#define SDMMC_FERACES_ACMDCRC_Msk             (_U_(0x1) << SDMMC_FERACES_ACMDCRC_Pos)              /**< (SDMMC_FERACES) Force Event for Auto CMD CRC Error Mask */
#define SDMMC_FERACES_ACMDCRC(value)          (SDMMC_FERACES_ACMDCRC_Msk & ((value) << SDMMC_FERACES_ACMDCRC_Pos))
#define SDMMC_FERACES_ACMDEND_Pos             _U_(3)                                               /**< (SDMMC_FERACES) Force Event for Auto CMD End Bit Error Position */
#define SDMMC_FERACES_ACMDEND_Msk             (_U_(0x1) << SDMMC_FERACES_ACMDEND_Pos)              /**< (SDMMC_FERACES) Force Event for Auto CMD End Bit Error Mask */
#define SDMMC_FERACES_ACMDEND(value)          (SDMMC_FERACES_ACMDEND_Msk & ((value) << SDMMC_FERACES_ACMDEND_Pos))
#define SDMMC_FERACES_ACMDIDX_Pos             _U_(4)                                               /**< (SDMMC_FERACES) Force Event for Auto CMD Index Error Position */
#define SDMMC_FERACES_ACMDIDX_Msk             (_U_(0x1) << SDMMC_FERACES_ACMDIDX_Pos)              /**< (SDMMC_FERACES) Force Event for Auto CMD Index Error Mask */
#define SDMMC_FERACES_ACMDIDX(value)          (SDMMC_FERACES_ACMDIDX_Msk & ((value) << SDMMC_FERACES_ACMDIDX_Pos))
#define SDMMC_FERACES_CMDNI_Pos               _U_(7)                                               /**< (SDMMC_FERACES) Force Event for Command Not Issued by Auto CMD12 Error Position */
#define SDMMC_FERACES_CMDNI_Msk               (_U_(0x1) << SDMMC_FERACES_CMDNI_Pos)                /**< (SDMMC_FERACES) Force Event for Command Not Issued by Auto CMD12 Error Mask */
#define SDMMC_FERACES_CMDNI(value)            (SDMMC_FERACES_CMDNI_Msk & ((value) << SDMMC_FERACES_CMDNI_Pos))
#define SDMMC_FERACES_Msk                     _U_(0x009F)                                          /**< (SDMMC_FERACES) Register Mask  */


/* -------- SDMMC_FEREIS : (SDMMC Offset: 0x52) ( /W 16) Force Event Register for Error Interrupt Status -------- */
#define SDMMC_FEREIS_CMDTEO_Pos               _U_(0)                                               /**< (SDMMC_FEREIS) Force Event for Command Timeout Error Position */
#define SDMMC_FEREIS_CMDTEO_Msk               (_U_(0x1) << SDMMC_FEREIS_CMDTEO_Pos)                /**< (SDMMC_FEREIS) Force Event for Command Timeout Error Mask */
#define SDMMC_FEREIS_CMDTEO(value)            (SDMMC_FEREIS_CMDTEO_Msk & ((value) << SDMMC_FEREIS_CMDTEO_Pos))
#define SDMMC_FEREIS_CMDCRC_Pos               _U_(1)                                               /**< (SDMMC_FEREIS) Force Event for Command CRC Error Position */
#define SDMMC_FEREIS_CMDCRC_Msk               (_U_(0x1) << SDMMC_FEREIS_CMDCRC_Pos)                /**< (SDMMC_FEREIS) Force Event for Command CRC Error Mask */
#define SDMMC_FEREIS_CMDCRC(value)            (SDMMC_FEREIS_CMDCRC_Msk & ((value) << SDMMC_FEREIS_CMDCRC_Pos))
#define SDMMC_FEREIS_CMDEND_Pos               _U_(2)                                               /**< (SDMMC_FEREIS) Force Event for Command End Bit Error Position */
#define SDMMC_FEREIS_CMDEND_Msk               (_U_(0x1) << SDMMC_FEREIS_CMDEND_Pos)                /**< (SDMMC_FEREIS) Force Event for Command End Bit Error Mask */
#define SDMMC_FEREIS_CMDEND(value)            (SDMMC_FEREIS_CMDEND_Msk & ((value) << SDMMC_FEREIS_CMDEND_Pos))
#define SDMMC_FEREIS_CMDIDX_Pos               _U_(3)                                               /**< (SDMMC_FEREIS) Force Event for Command Index Error Position */
#define SDMMC_FEREIS_CMDIDX_Msk               (_U_(0x1) << SDMMC_FEREIS_CMDIDX_Pos)                /**< (SDMMC_FEREIS) Force Event for Command Index Error Mask */
#define SDMMC_FEREIS_CMDIDX(value)            (SDMMC_FEREIS_CMDIDX_Msk & ((value) << SDMMC_FEREIS_CMDIDX_Pos))
#define SDMMC_FEREIS_DATTEO_Pos               _U_(4)                                               /**< (SDMMC_FEREIS) Force Event for Data Timeout error Position */
#define SDMMC_FEREIS_DATTEO_Msk               (_U_(0x1) << SDMMC_FEREIS_DATTEO_Pos)                /**< (SDMMC_FEREIS) Force Event for Data Timeout error Mask */
#define SDMMC_FEREIS_DATTEO(value)            (SDMMC_FEREIS_DATTEO_Msk & ((value) << SDMMC_FEREIS_DATTEO_Pos))
#define SDMMC_FEREIS_DATCRC_Pos               _U_(5)                                               /**< (SDMMC_FEREIS) Force Event for Data CRC error Position */
#define SDMMC_FEREIS_DATCRC_Msk               (_U_(0x1) << SDMMC_FEREIS_DATCRC_Pos)                /**< (SDMMC_FEREIS) Force Event for Data CRC error Mask */
#define SDMMC_FEREIS_DATCRC(value)            (SDMMC_FEREIS_DATCRC_Msk & ((value) << SDMMC_FEREIS_DATCRC_Pos))
#define SDMMC_FEREIS_DATEND_Pos               _U_(6)                                               /**< (SDMMC_FEREIS) Force Event for Data End Bit Error Position */
#define SDMMC_FEREIS_DATEND_Msk               (_U_(0x1) << SDMMC_FEREIS_DATEND_Pos)                /**< (SDMMC_FEREIS) Force Event for Data End Bit Error Mask */
#define SDMMC_FEREIS_DATEND(value)            (SDMMC_FEREIS_DATEND_Msk & ((value) << SDMMC_FEREIS_DATEND_Pos))
#define SDMMC_FEREIS_CURLIM_Pos               _U_(7)                                               /**< (SDMMC_FEREIS) Force Event for Current Limit Error Position */
#define SDMMC_FEREIS_CURLIM_Msk               (_U_(0x1) << SDMMC_FEREIS_CURLIM_Pos)                /**< (SDMMC_FEREIS) Force Event for Current Limit Error Mask */
#define SDMMC_FEREIS_CURLIM(value)            (SDMMC_FEREIS_CURLIM_Msk & ((value) << SDMMC_FEREIS_CURLIM_Pos))
#define SDMMC_FEREIS_ACMD_Pos                 _U_(8)                                               /**< (SDMMC_FEREIS) Force Event for Auto CMD Error Position */
#define SDMMC_FEREIS_ACMD_Msk                 (_U_(0x1) << SDMMC_FEREIS_ACMD_Pos)                  /**< (SDMMC_FEREIS) Force Event for Auto CMD Error Mask */
#define SDMMC_FEREIS_ACMD(value)              (SDMMC_FEREIS_ACMD_Msk & ((value) << SDMMC_FEREIS_ACMD_Pos))
#define SDMMC_FEREIS_ADMA_Pos                 _U_(9)                                               /**< (SDMMC_FEREIS) Force Event for ADMA Error Position */
#define SDMMC_FEREIS_ADMA_Msk                 (_U_(0x1) << SDMMC_FEREIS_ADMA_Pos)                  /**< (SDMMC_FEREIS) Force Event for ADMA Error Mask */
#define SDMMC_FEREIS_ADMA(value)              (SDMMC_FEREIS_ADMA_Msk & ((value) << SDMMC_FEREIS_ADMA_Pos))
#define SDMMC_FEREIS_BOOTAE_Pos               _U_(12)                                              /**< (SDMMC_FEREIS) Force Event for Boot Acknowledge Error Position */
#define SDMMC_FEREIS_BOOTAE_Msk               (_U_(0x1) << SDMMC_FEREIS_BOOTAE_Pos)                /**< (SDMMC_FEREIS) Force Event for Boot Acknowledge Error Mask */
#define SDMMC_FEREIS_BOOTAE(value)            (SDMMC_FEREIS_BOOTAE_Msk & ((value) << SDMMC_FEREIS_BOOTAE_Pos))
#define SDMMC_FEREIS_Msk                      _U_(0x13FF)                                          /**< (SDMMC_FEREIS) Register Mask  */


/* -------- SDMMC_AESR : (SDMMC Offset: 0x54) ( R/ 8) ADMA Error Status Register -------- */
#define SDMMC_AESR_ERRST_Pos                  _U_(0)                                               /**< (SDMMC_AESR) ADMA Error State Position */
#define SDMMC_AESR_ERRST_Msk                  (_U_(0x3) << SDMMC_AESR_ERRST_Pos)                   /**< (SDMMC_AESR) ADMA Error State Mask */
#define SDMMC_AESR_ERRST(value)               (SDMMC_AESR_ERRST_Msk & ((value) << SDMMC_AESR_ERRST_Pos))
#define SDMMC_AESR_LMIS_Pos                   _U_(2)                                               /**< (SDMMC_AESR) ADMA Length Mismatch Error Position */
#define SDMMC_AESR_LMIS_Msk                   (_U_(0x1) << SDMMC_AESR_LMIS_Pos)                    /**< (SDMMC_AESR) ADMA Length Mismatch Error Mask */
#define SDMMC_AESR_LMIS(value)                (SDMMC_AESR_LMIS_Msk & ((value) << SDMMC_AESR_LMIS_Pos))
#define SDMMC_AESR_Msk                        _U_(0x07)                                            /**< (SDMMC_AESR) Register Mask  */


/* -------- SDMMC_ASAR0 : (SDMMC Offset: 0x58) (R/W 32) ADMA System Address Register 0 -------- */
#define SDMMC_ASAR0_ADMASA_Pos                _U_(0)                                               /**< (SDMMC_ASAR0) ADMA System Address Position */
#define SDMMC_ASAR0_ADMASA_Msk                (_U_(0xFFFFFFFF) << SDMMC_ASAR0_ADMASA_Pos)          /**< (SDMMC_ASAR0) ADMA System Address Mask */
#define SDMMC_ASAR0_ADMASA(value)             (SDMMC_ASAR0_ADMASA_Msk & ((value) << SDMMC_ASAR0_ADMASA_Pos))
#define SDMMC_ASAR0_Msk                       _U_(0xFFFFFFFF)                                      /**< (SDMMC_ASAR0) Register Mask  */


/* -------- SDMMC_PVR : (SDMMC Offset: 0x60) (R/W 16) Preset Value Register 0 (for initialization) -------- */
#define SDMMC_PVR_SDCLKFSEL_Pos               _U_(0)                                               /**< (SDMMC_PVR) SDCLK Frequency Select Position */
#define SDMMC_PVR_SDCLKFSEL_Msk               (_U_(0x3FF) << SDMMC_PVR_SDCLKFSEL_Pos)              /**< (SDMMC_PVR) SDCLK Frequency Select Mask */
#define SDMMC_PVR_SDCLKFSEL(value)            (SDMMC_PVR_SDCLKFSEL_Msk & ((value) << SDMMC_PVR_SDCLKFSEL_Pos))
#define SDMMC_PVR_CLKGSEL_Pos                 _U_(10)                                              /**< (SDMMC_PVR) Clock Generator Select Position */
#define SDMMC_PVR_CLKGSEL_Msk                 (_U_(0x1) << SDMMC_PVR_CLKGSEL_Pos)                  /**< (SDMMC_PVR) Clock Generator Select Mask */
#define SDMMC_PVR_CLKGSEL(value)              (SDMMC_PVR_CLKGSEL_Msk & ((value) << SDMMC_PVR_CLKGSEL_Pos))
#define SDMMC_PVR_DRVSEL_Pos                  _U_(14)                                              /**< (SDMMC_PVR) Driver Strength Select Position */
#define SDMMC_PVR_DRVSEL_Msk                  (_U_(0x3) << SDMMC_PVR_DRVSEL_Pos)                   /**< (SDMMC_PVR) Driver Strength Select Mask */
#define SDMMC_PVR_DRVSEL(value)               (SDMMC_PVR_DRVSEL_Msk & ((value) << SDMMC_PVR_DRVSEL_Pos))
#define SDMMC_PVR_Msk                         _U_(0xC7FF)                                          /**< (SDMMC_PVR) Register Mask  */


/* -------- SDMMC_SISR : (SDMMC Offset: 0xFC) ( R/ 16) Slot Interrupt Status Register -------- */
#define SDMMC_SISR_INTSSL_Pos                 _U_(0)                                               /**< (SDMMC_SISR) Interrupt Signal for Each Slot Position */
#define SDMMC_SISR_INTSSL_Msk                 (_U_(0x3) << SDMMC_SISR_INTSSL_Pos)                  /**< (SDMMC_SISR) Interrupt Signal for Each Slot Mask */
#define SDMMC_SISR_INTSSL(value)              (SDMMC_SISR_INTSSL_Msk & ((value) << SDMMC_SISR_INTSSL_Pos))
#define SDMMC_SISR_Msk                        _U_(0x0003)                                          /**< (SDMMC_SISR) Register Mask  */


/* -------- SDMMC_HCVR : (SDMMC Offset: 0xFE) ( R/ 16) Host Controller Version Register -------- */
#define SDMMC_HCVR_SVER_Pos                   _U_(0)                                               /**< (SDMMC_HCVR) Specification Version Number Position */
#define SDMMC_HCVR_SVER_Msk                   (_U_(0xFF) << SDMMC_HCVR_SVER_Pos)                   /**< (SDMMC_HCVR) Specification Version Number Mask */
#define SDMMC_HCVR_SVER(value)                (SDMMC_HCVR_SVER_Msk & ((value) << SDMMC_HCVR_SVER_Pos))
#define SDMMC_HCVR_VVER_Pos                   _U_(8)                                               /**< (SDMMC_HCVR) Vendor Version Number Position */
#define SDMMC_HCVR_VVER_Msk                   (_U_(0xFF) << SDMMC_HCVR_VVER_Pos)                   /**< (SDMMC_HCVR) Vendor Version Number Mask */
#define SDMMC_HCVR_VVER(value)                (SDMMC_HCVR_VVER_Msk & ((value) << SDMMC_HCVR_VVER_Pos))
#define SDMMC_HCVR_Msk                        _U_(0xFFFF)                                          /**< (SDMMC_HCVR) Register Mask  */


/* -------- SDMMC_APSR : (SDMMC Offset: 0x200) ( R/ 32) Additional Present State Register -------- */
#define SDMMC_APSR_HDATLL_Pos                 _U_(0)                                               /**< (SDMMC_APSR) DAT[7:4] High Line Level Position */
#define SDMMC_APSR_HDATLL_Msk                 (_U_(0xF) << SDMMC_APSR_HDATLL_Pos)                  /**< (SDMMC_APSR) DAT[7:4] High Line Level Mask */
#define SDMMC_APSR_HDATLL(value)              (SDMMC_APSR_HDATLL_Msk & ((value) << SDMMC_APSR_HDATLL_Pos))
#define SDMMC_APSR_Msk                        _U_(0x0000000F)                                      /**< (SDMMC_APSR) Register Mask  */


